a = false;
if (null != localStorage.getItem("name") && "" != localStorage.getItem("name")) {
	var classify = new Array("蠢萌的前提是萌，不是蠢", "你以为有钱人很快乐吗</br>他们的快乐你根本想象不到", "时间真的能改变一个人</br>比如你以前丑，现在更丑", "条条大路通罗马</br>而有些人就住在罗马", "你只看到别人表面上春风得意</br>却不知道人家背后也风生水起", "人生就像一杯水</br>孤独，孤独，孤独，一辈子就完了", "别灰心， 人生就是这样</br>起起落落落落落落落落落落落的", "长得丑就是病</br>不然为什么整形医院叫医院", "努力加油，每一个困难，都会克服你。", "你并不是一无所有</br>你还有病", "一个人会孤单，但会心安", "熬夜对身体不好</br>建议你通宵", "每当你找到成功的钥匙</br>就发现有人把锁芯给换了", "不爱你的人，比你想象中的还不爱你", "失败是成功之母</br>可惜成功六亲不认", "困难也许会迟到，但绝不缺席。", "你全心全意的付出</br>还不如别人的随便搞搞", "哪有什么心静自然凉</br>明明是心凉整个人就静了", "人生苦短，我又他妈懒", "你恨对方，对方对此毫不在乎", "自从学会了破罐破摔</br>感觉一切都浑然开朗多了", "有人出现在你的生命里</br>是为了告诉你，你真好骗", "多照照镜子</br>很多事情，你就明白原因了", "上帝为你关上了一扇门</br>然后洗洗睡了", "生活不止眼前的苟且</br>还有未来的苟且", "如果你不努力</br>就不知道什么叫绝望", "转角一般不会遇到爱</br>只会遇到乞丐", "56个民族，55个加分", "万事开头难，然后中间难，最后结尾难", "哪有什么选择恐惧症</br>还不是因为穷", "充电五分钟，通话两小时</br>可是你连通话五分钟的人都没有", "好好活下去</br>每天都有新打击", "长的好看有用吗？</br>太有用了", "只有真正努力过的人才知道</br>天赋有多重要", "注重细节，从小事做起</br>因为你也做不了大事", "长得丑的人，光长相别人就不能原谅</br>更别提犯不犯错了", "其实根本没有真正高冷的人</br>只不过人家暖的不是你", "人们希望你做的更好</br>但一般不希望你超过他", "垃圾食品都特别好吃</br>人渣也都特别有魅力", "当别人和你说很忙</br>是他要留时间给更重要的人", "你总说有一天要干嘛干嘛</br>好像那天真会来一样", "如果上天没有给你想要的</br>不是你值得拥有更好的，而是你不配", "虽然你长得丑，但是你想得美啊", "闭上眼睛就可以看到未来</br>原来是真的", "长得漂亮的人</br>即使犯了错，别人也很容易原谅", "当你选择离开时，就会发现</br>即使没有你，太阳照常升起", "你喜欢的人不喜欢你</br>说明他很有眼光", "咸鱼，总有翻身的一天</br>但翻身之后还是咸鱼", "不要太依赖朋友</br>人性基本都有恶的一面", "这个世界上没有永远的爱情</br>时间可以冲淡一切", "喜欢就去追呀</br>反正你也追不到", "笑着走下去吧</br>反正来到这个世界上，谁也没打算活着回去", "永远不要给背叛过自己的朋友第二次的背叛的机会", "为什么要吵架呢</br>就不能心平气和的坐下来，打对方几巴掌吗？", "年轻的时候多吃些苦</br>这样老了吃苦才习惯", "你没那么多观众，别那么累", "只要是石头，到哪里都不会发光的", "人生如电影</br>你演的都是恐怖片", "等忙完这一阵</br>就可以接着忙下一阵了", "努力不一定会成功</br>但是不努力一定很舒服", "喜欢一个人就勇敢表白</br>也许你还能知道自己是几号备胎", "做梦梦到自己特别穷</br>醒来发现也不是梦", "失恋的时候以为全世界都抛弃了自己</br>其实世界从未需要过你", "哪有什么来日方长，挥手便是人走茶凉。", "我们非常努力，才能活得像个普通人", "你全力做到的最好</br>可能还不如别人随便搞搞", "没人会嘲笑你的梦想</br>他们都是在嘲笑你的实力", "当你真正努力了就会知道</br>智商上的差距是不可逾越的", "虽然你单身</br>但是你胖若两人", "好女孩只得到了好字</br>而漂亮女孩却得到了所有", "好人成佛要经历九九八十一难</br>而坏人只需放下屠刀", "只要坚持下去</br>你就发现幸运一定会发生在别人身上", "生活不止眼前的苟且</br>还有读不懂的诗和到不了的远方", "失败并不可怕</br>可怕的是你还相信这句话", "如果一个人秒回了你</br>说明这个人在玩手机", "有的人是来爱你的</br>有的人就是来给你上课的", "请相信我，我所说的每句话，都是废话！", "你就像是蓝天上的太阳，让人无法直视", "要相信自己，别人能做到的，你也做不到", "上帝为你关上一扇窗</br>还会为你带上门", "对今天解决不了的事情，不要着急</br>因为明天也解决不了", "年轻人嘛，现在没钱算什么</br>以后没钱的日子还多着呢");var state;
	if (Math.round(Math.random() * 100) < 60) {
		var now = new Date(),
			hour = now.getHours();
		if (hour < 5 && hour > 2) {
			classify = new Array("凌晨好！")
		} else if (hour < 9) {
			classify = new Array("早安！", "早上好！", "早安元气满！", "新一天事事顺心！", "早起的鸟儿有虫吃！")
		} else if (hour < 11) {
			classify = new Array("上午好！")
		} else if (hour < 14) {
			classify = new Array("中午好！","午安！")
		} else if (hour < 17) {
			classify = new Array("下午好！")
		} else if (hour < 19) {
			classify = new Array("傍晚好！")
		} else if (hour < 22) {
			classify = new Array("晚上好！")
		} else {
			classify = new Array("夜深了，晚安！","早睡早起身体好！")
		}
		a = true;
	}
	var index = Math.round(Math.random() * (classify.length - 1));
	state = classify[index]
	$(".subtitle").html(localStorage.getItem("name") + "，" + state)
}